[{"_id":"Measure-What-Matters","n":"Measure What Matters","i":"https://user-images.githubusercontent.com/4745789/71710580-f6a51080-2e22-11ea-915d-e493ef7b6e22.jpg","d":"The book is about musing Objectives and Key Results (OKRs) to make tough choices on business priorities.","plnk":"https://amzn.to/37xuDEg","total":320,"pg":199,"com":false,"hgs":[{"t":"It almost does not matter what you know, knowledge is secondary and execution all important.","at":1578034395261}],"uat":1578127567000},{"_id":"The Fabric of the Cosmos","n":"The Fabric of the Cosmos","i":"https://user-images.githubusercontent.com/4745789/69913016-49705e80-1458-11ea-8d1a-40fba62cf80e.jpg","d":"Brian Greene's The Fabric of the Cosmos takes us on an irresistible and revelatory journey through the biggest of the big questions.","plnk":"https://amzn.to/2P7pjzY","total":592,"pg":40,"com":false,"hgs":[{"t":"In the book, The Myth of Sisyphus, Camus asked best known existential question\n\n\"There is really only one serious philosophical question, and that is suicide.\"\n\nIn a not so harsh way, it can be put as \"Is your life worth living?\" and that is what all boils down to, everything else is just detail.","at":1575224628709},{"t":"Reality is revealed to us by our experiences.","at":1575969846194},{"t":"By deepening our understanding of the true nature of physical reality, we profoundly reconfigure our sense of ourselves and our experience of the universe.","at":1575969988878},{"t":"The happenings in the universe not only are explicable but predictable. The true power of science is to foretell the aspects of the future - consistently and quantitatively.","at":1575970353931},{"t":"Space and Time were merely the vocabulary of relations between where objects were and when events took place. But to Albert Einstein, they were the raw material underlying reality.","at":1575970534746},{"t":"Understanding requires context, insights must be anchored.","at":1575970577016},{"t":"Space and Time are far from being rigid and unchanging structures as envisioned by Newton. Einstein showed that Space and Time wrap and curve, and thus participate and shape the cosmic evolution.","at":1575972470562},{"t":"Even though Newton's notion of space and time was incorrect, Newtonian physics provides an extremely accurate approximations to be used in various situations. It breaks only in conditions with extreme speed or gravity.","at":1575972764825},{"t":"According to Quantum Mechanics, universe participates in a game of chance.","at":1575999433345}],"uat":1578127566000},{"_id":"Hooked:-How-to-Build-Habit-Forming-Products","n":"Hooked: How to Build Habit-Forming Products","i":"https://user-images.githubusercontent.com/4745789/71711331-8bf5d400-2e26-11ea-91a7-a8746e312a4a.jpg","d":"Hooked is based on Eyal’s years of research, consulting, and practical experience.  It explains Why do some products capture widespread attention while others flop? What makes us engage with certain products out of sheer habit? Is there a pattern underlying how technologies hook us?","plnk":"https://amzn.to/2sLp8TF","total":243,"pg":243,"com":true,"hgs":[],"uat":1578127565000},{"_id":"Brief-Answers-to-the-Big-Questions:-the-final-book-from-Stephen-Hawking","n":"Brief Answers to the Big Questions: the final book from Stephen Hawking","i":"https://user-images.githubusercontent.com/4745789/71715326-0af30880-2e37-11ea-9f55-a0b4f924ae47.jpg","d":"Stephen Hawking's final thoughts on the universe's biggest questions in this brilliant posthumous work. Is there a God? How did it all begin? Can we predict the future? What is inside a black hole? Is there other intelligent life in the universe? Will artificial intelligence outsmart us? and many more.","plnk":"https://amzn.to/2SMiSWb","total":256,"pg":256,"com":true,"hgs":[],"uat":1578127564000},{"_id":"Before-You-Know-It","n":"Before You Know It","i":"https://user-images.githubusercontent.com/4745789/71726921-9633c480-2e5e-11ea-8b5a-fb280cdd9f61.jpg","d":"Before You Know profoundly changes the way you understand yourself by introducing you to a fascinating world only recently discovered, the world that exists below the surface of your awareness and yet is the key to unlocking new ways of thinking, feeling and behaving.","plnk":"https://amzn.to/37tXt8v","total":352,"pg":352,"com":true,"hgs":[],"uat":1578127563000}]