[
    {
        "_id": "on-judging-others",
        "b": "Don't keep yourself busy judging others; your brain can only have a limited number of thoughts every day and even your day has a limited number of seconds in it, use them wisely.",
        "d": 20200923,
        "top": "growth"
    },
    {
        "_id": "books-for-unknowns",
        "b": "Books can never replace the actual experience but it does a wonderful job of preparing you for the unknowns.",
        "d": 20200922,
        "top": "growth"
    },
    {
        "_id": "compounding-growth",
        "b": "Growth compounds if you have self-discipline, willpower, and perseverance.",
        "d": 20200921,
        "top": "growth"
    },
    {
        "_id": "anxiety-a-fuel",
        "b": "Anxiety and Restlessness is fuel for someone who knows how to wield it. It provides the necessary nudge to set you in motion.",
        "d": 20200919,
        "top": "growth"
    },
    {
        "_id": "impartial-opinions",
        "b": "Having an opinion about stuff you don't understand is fatal. Impartial opinions always form when you have a deep understanding of the matter.",
        "d": 20200918,
        "top": "growth"
    },
    {
        "_id": "discuss-ideas",
        "b": "Discuss ideas, not people.",
        "d": 20200917,
        "top": "growth"
    },
    {
        "_id": "scroll-learn",
        "b": "If you have time to scroll, you have time to learn.",
        "d": 20200916,
        "top": "growth"
    },
    {
        "_id": "24-time-management",
        "b": "Everyone gets 24 hours every day, what determines success is its optimum utilization. The only skill required to be successful is - Time Management.",
        "d": 20200915,
        "top": "growth"
    },
    {
        "_id": "failure-failure",
        "b": "Having a failure is different from being a failure. Unfortunately, we exaggerate.",
        "d": 20200914,
        "top": "growth"
    },
    {
        "_id": "seek-progress",
        "b": "Seek progress and not cheap validation.",
        "d": 20200812,
        "top": "growth"
    },
    {
        "_id": "critical-questions",
        "b": "The right set of critical questions is important to solve any problem better.",
        "d": 20200911,
        "top": "growth"
    },
    {
        "_id": "disagreement",
        "b": "Disagreement should never make you angry.",
        "d": 20200909,
        "top": "growth"
    },
    {
        "_id": "write",
        "b": "To understand what you don't understand - write.",
        "d": 20200907,
        "top": "growth"
    },
    {
        "_id": "stupidity-critical",
        "b": "Be critical of your own stupidity, more often than not, it is the root cause.",
        "d": 20200904,
        "top": "growth"
    },
    {
        "_id": "autopilot",
        "b": "Living on autopilot is easy so don't do that.",
        "d": 20200902,
        "top": "growth"
    },
    {
        "_id": "people-surround",
        "b": "You are a result of the people you choose to be surrounded by.",
        "d": 20200831,
        "top": "growth"
    },
    {
        "_id": "time-constraint",
        "b": "The only constraint, that is truly universal and applies to every single one of us, is time.",
        "d": 20200821,
        "top": "growth"
    },
    {
        "_id": "you-are-wrong",
        "b": "Quickly identifying and acknowledging you are wrong is much more beneficial than justifying how you are right.",
        "d": 20200819,
        "top": "growth"
    },
    {
        "_id": "greatness-perseverance",
        "b": "Greatness can be achieved with raw perseverance but success can only be attained when persistent efforts are made in the right direction.",
        "d": 20200817,
        "top": "growth"
    },
    {
        "_id": "detachment-execution",
        "b": "Detachment improves execution.",
        "d": 20200814,
        "top": "growth"
    },
    {
        "_id": "compete-better",
        "b": "Compete with someone who is better than you.",
        "d": 20200812,
        "top": "growth"
    },
    {
        "_id": "solve-non-trivial",
        "b": "Solve non-trivial problems, for there is no easy way to success.",
        "d": 20200810,
        "top": "growth"
    },
    {
        "_id": "worst-in-head",
        "b": "The worst always happens in your head.",
        "d": 20200807,
        "top": "growth"
    },
    {
        "_id": "talent-decade",
        "b": "Talent, more often than not, is just a decade worth of channeled effort and perseverance.",
        "d": 20200805,
        "top": "growth"
    },
    {
        "_id": "unlearning",
        "b": "Unlearning is more important than learning.",
        "d": 20200803,
        "top": "growth"
    },
    {
        "_id": "anonymity",
        "b": "Anonymity allows everyone to say the truth; people who do not long for it, are fearless and, more often than not, are the ones that bring the necessary paradigm shifts.",
        "d": 20200731,
        "top": "growth"
    },
    {
        "_id": "true-learning",
        "b": "True learning happens when we are purely driven by our intellectual curiosity while being devoid of any deadline or a need for external validation.",
        "d": 20200729,
        "top": "growth"
    },
    {
        "_id": "victim-card-growth",
        "b": "Playing the victim card is the first line of defense and a default option that we have developed over our evolutionary course. Growth seekers avoid playing it.",
        "d": 20200724,
        "top": "growth"
    },
    {
        "_id": "self-confidence",
        "b": "We become self-confident once we start repeatedly doing what we thought we couldn't do; while we become overconfident when we mightily overestimate our abilities just to put forth a false persona.",
        "d": 20200722,
        "top": "growth"
    },
    {
        "_id": "understood-not-forget",
        "b": "You never forget what you actually understood.",
        "d": 20200720,
        "top": "growth"
    },
    {
        "_id": "time-management",
        "b": "Managing time is hard, and the ability to do it well is no less than a superpower.",
        "d": 20200717,
        "top": "growth"
    },
    {
        "_id": "impulsive-decisions",
        "b": "Impulsive decisions made while you are having a bad day are, more often than not, detrimental and damaging.",
        "d": 20200715,
        "top": "growth"
    },
    {
        "_id": "financial-independence-thoughts",
        "b": "No thoughts or actions are truly independent without financial independence.",
        "d": 20200713,
        "top": "growth"
    },
    {
        "_id": "crazy-plan",
        "b": "Your plan should always sound a little crazier.",
        "d": 20200710,
        "top": "growth"
    },
    {
        "_id": "reaction",
        "b": "A lot of things in life don't seek your reaction.",
        "d": 20200708,
        "top": "growth"
    },
    {
        "_id": "capabilities-and-execution",
        "b": "Capabilities don't matter until you act on it.",
        "d": 20200706,
        "top": "growth"
    },
    {
        "_id": "external-factors",
        "b": "Blaming externals (people or situations) for our setbacks and failures is an escape, that is best avoided.",
        "d": 20200703,
        "top": "growth"
    },
    {
        "_id": "victim-card",
        "b": "Playing the victim card is an excuse. The world is ruthless and if you want to survive, you need to up your game.",
        "d": 20200701,
        "top": "growth"
    },
    {
        "_id": "limits-dne",
        "b": "Most limits do not exist, they are mere hurdles, your mind has created to keep you in your comfort.",
        "d": 20200624,
        "top": "growth"
    },
    {
        "_id": "insecure-teachers",
        "b": "Insecure teachers try to act and sound smart; they seek validation by dominating struggling students.",
        "d": 20200622,
        "top": "growth"
    },
    {
        "_id": "changing-life",
        "b": "Changing your life is hard and it will take a lot of risk, effort, and time to steer it as you desire.,",
        "d": 20200619,
        "top": "growth"
    },
    {
        "_id": "change-habit",
        "b": "Changing your habit without changing your environment is impossible. Environment, you have been habituated with, will always be a reminder of your past behaviour and practices.",
        "d": 20200617,
        "top": "growth"
    },
    {
        "_id": "qualitative-reading",
        "b": "Reading is important but it should be Qualitative, and not Quantitative. Quality reading translating into daily life action items is calibre.",
        "d": 20200615,
        "top": "growth"
    },
    {
        "_id": "interesting-ideas",
        "b": "Most interesting ideas brew when the participants are few but involved, passionate, and insightful.",
        "d": 20200612,
        "top": "growth"
    },
    {
        "_id": "cleverness",
        "b": "It is always better to underestimate than to overestimate your cleverness.",
        "d": 20200610,
        "top": "growth"
    },
    {
        "_id": "habit-tracking",
        "b": "You do not need habit tracking apps to form a habit; nothing works better than an aggressively defined goal.",
        "d": 20200608,
        "top": "growth"
    },
    {
        "_id": "problem-solving",
        "b": "Solving a problem 80% is simple; and all you need is some critical thinking and a knack to split it into solvable sub-problems; although for the other 20% you will require domain expertise. Approach, attitude, and grit help tackle a problem better than domain expertise.",
        "d": 20200608,
        "top": "growth"
    },
    {
        "_id": "recreational-reading",
        "b": "Recreational reading is underrated.",
        "d": 20200604,
        "top": "growth"
    },
    {
        "_id": "time-currency",
        "b": "Time is a currency don't spend it, invest it.",
        "d": 20200602,
        "top": "growth"
    },
    {
        "_id": "curiosity-drives-motivation",
        "b": "Curiosity drives motivation.\n\nIf you are not motivated enough, question yourself - are you curious enough?",
        "d": 20200420,
        "top": "growth"
    },
    {
        "_id": "stuck-in-past",
        "b": "Most people are stuck in the past.",
        "d": 20200417,
        "top": "growth"
    },
    {
        "_id": "impatience",
        "b": "Impatience is the most effective catalyst.",
        "d": 20200415,
        "top": "growth"
    },
    {
        "_id":"deadline",
        "b":"Nothing moves us forward like a deadline.",
        "d":20200114,
        "top":"growth"
    },
    {
        "_id":"credentials",
        "b":"Credentials can only take you from 0 to 0.0001 but then it is accomplishments that take over.",
        "d":20200113,
        "top":"growth"
    },
    {
        "_id":"decisions",
        "b":"Our brain doesn't like to decide a lot, it thrives on clarity, certainty, and explicitness.\n\nThings you should do to be more efficient:\n\n - big task at hand? - break into sub-tasks\n - Confused between two equals? - pick one at random\n - Do not overthink unless required",
        "d":20200106,
        "top":"growth"
    },
    {
        "_id":"problem",
        "b":"A problem well understood is well-solved.",
        "d":20191220,
        "top":"growth"
    },
    {
        "_id":"public-goals",
        "b":"Make your goals public - print it out and stick it somewhere for everyone to see. There is no better motivation and obligation than public commitment.",
        "d":20191218,
        "top":"growth"
    },
    {
        "_id":"successful",
        "b":"Do not fail to see how successful you already are.",
        "d":20191214,
        "top":"growth"
    },
    {
        "_id":"measure",
        "b":"Measure your progress, growth and output, quantitatively and systematically, and then analyze how to get more of it.",
        "d":20191212,
        "top":"growth"
    },
    {
        "_id":"execution",
        "b":"It almost doesn’t matter what you know, unless you put it to use. Knowledge is secondary while execution is all-important.",
        "d":20191211,
        "top":"growth"
    },
    {
        "_id":"ask-what-you-care",
        "b":"Ask yourself what you care about that you haven’t been able to pursue in your job.",
        "d":20191209,
        "top":"growth"
    },
    {
        "_id":"iteration",
        "b":"Iteration is easy, innovation is hard but innovating while you iterate is insanely difficult.\n\nPeople and companies who do it excel while others just survive.",
        "d":20191119,
        "top":"growth"
    },
    {
        "_id":"high-performance",
        "b":"Anyone striving for high performance and productivity, personally or at workplace note - setting goals is very necessary, for it is impossible to achieve something that you've never defined.\n\nSerendipity is rare.",
        "d":20191117,
        "top":"growth"
    },
    {
        "_id":"goals",
        "b":"Set audacious yet believable goals, so that even if you fail, your failure is above others' success.",
        "d":20191111,
        "top":"growth"
    }
]
