[
    {
        "_id": "recreational-reading",
        "b": "Recreational reading is underrated.",
        "d": 20200604,
        "top": "growth"
    },
    {
        "_id": "time-currency",
        "b": "Time is a currency don't spend it, invest it.",
        "d": 20200602,
        "top": "growth"
    },
    {
        "_id": "curiosity-drives-motivation",
        "b": "Curiosity drives motivation.\n\nIf you are not motivated enough, question yourself - are you curious enough?",
        "d": 20200420,
        "top": "growth"
    },
    {
        "_id": "build-a-solution",
        "b": "Build a solution, not a hack.",
        "d": 20200419,
        "top": "engineering"
    },
    {
        "_id": "orm-suboptimal",
        "b": "ORMs are suboptimal convenience.",
        "d": 20200418,
        "top": "engineering"
    },
    {
        "_id": "stuck-in-past",
        "b": "Most people are stuck in the past.",
        "d": 20200417,
        "top": "growth"
    },
    {
        "_id": "datetime-objects-in-db",
        "b": "It is criminal to store datetime objects in a relational databases.\n\nUse epoch seconds, milliseconds or even microseconds, but never as datetime.",
        "d": 20200416,
        "top": "engineering"
    },
    {
        "_id": "impatience",
        "b": "Impatience is the most effective catalyst.",
        "d": 20200415,
        "top": "growth"
    },
    {
        "_id": "happiness-quotient",
        "b": "You cannot make all of your customers happy, you always try to maximize the overall happiness quotient.",
        "d": 20200115,
        "top": "product"
    },
    {
        "_id":"deadline",
        "b":"Nothing moves us forward like a deadline.",
        "d":20200114,
        "top":"growth"
    },
    {
        "_id":"credentials",
        "b":"Credentials can only take you from 0 to 0.1 but then it is accomplishments that take over.",
        "d":20200113,
        "top":"growth"
    },
    {
        "_id":"decisions",
        "b":"Our brain doesn't like to decide a lot, it thrives on clarity, certainty, and explicitness.\n\nThings you should do to be more efficient:\n\n - big task at hand? - break into sub-tasks\n - Confused between two equals? - pick one at random\n - Do not overthink unless required",
        "d":20200106,
        "top":"growth"
    },
    {
        "_id":"community-organization",
        "b":"An organization is a community that thrives on trust, compassion, respect and admiration; and should not be misunderstood as just a money making machine. Money made is just a by product of the efforts put in by the people.",
        "d":20200104,
        "top":"growth"
    },
    {
        "_id":"problem",
        "b":"A problem well understood is well-solved.",
        "d":20191220,
        "top":"product"
    },
    {
        "_id":"public-goals",
        "b":"Make your goals public - print it out and stick it somewhere for everyone to see. There is no better motivation and obligation than public commitment.",
        "d":20191218,
        "top":"growth"
    },
    {
        "_id":"todo-or-not-todo",
        "b":"To do or not to do, that is the question; and market research is the answer.\n\nDon't jump into building your product, even a MVP. Do some market research, float a survey in relevant communities. Assert your product is the painkiller that market needs.",
        "d":20191216,
        "top":"product"
    },
    {
        "_id":"successful",
        "b":"Do not fail to see how successful you already are.",
        "d":20191214,
        "top":"growth"
    },
    {
        "_id":"measure",
        "b":"Measure your progress, growth and output, quantitatively and systematically, and then analyze how to get more of it.",
        "d":20191212,
        "top":"growth"
    },
    {
        "_id":"execution",
        "b":"It almost doesn’t matter what you know, unless you put it to use. Knowledge is secondary while execution is all-important.",
        "d":20191211,
        "top":"growth"
    },
    {
        "_id":"doing-everything-on-own-is-infeasible",
        "b":"You cannot do/handle everything on your own, hence you have find the best people and delegate.",
        "d":20191210,
        "top":"growth"
    },
    {
        "_id":"ask-what-you-care",
        "b":"Ask yourself what you care about that you haven’t been able to pursue in your job.",
        "d":20191209,
        "top":"growth"
    },
    {
        "_id":"iteration",
        "b":"Iteration is easy, innovation is hard but innovating while you iterate is insanely difficult.\n\nPeople and companies who do it excel while others just survive.",
        "d":20191119,
        "top":"growth"
    },
    {
        "_id":"high-performance",
        "b":"Anyone striving for high performance and productivity, personally or at workplace note - setting goals is very necessary, for it is impossible to achieve something that you've never defined.\n\nSerendipity is rare.",
        "d":20191117,
        "top":"growth"
    },
    {
        "_id":"product-experience",
        "b":"Most of the world does not experience your product the way you are experiencing it during development.\n\nMost of your users would\n - have an inconsistent low strength 2g connection\n - be far from the servers than you probably are.\n\nHence also measure actual user experience.",
        "d":20191112,
        "top":"product"
    },
    {
        "_id":"goals",
        "b":"Set audacious yet believable goals, so that even if you fail, your failure is above others' success.",
        "d":20191111,
        "top":"growth"
    },
    {
        "_id":"theortetical-ideas",
        "b":"Ideas are theoretical, but execution is where the magic happens. Products with better execution always leap ahead.",
        "d":20191110,
        "top":"growth"
    }
]