[
    {
        "n": "Be so good they can't ignore you."
    },
    {
        "n": "You don't really find an audience for your work; they find you. In order to be found, you have\nto be findable."
    },
    {
        "n": "Build sharing in your routine."
    },
    {
        "n": "Consistently post bits and pieces of your work, your ideas, and what you are learning online."
    },
    {
        "n": "Generously share your ideas and your knowledge, you often gain an audience that you can then leverage when you need it - for fellowship, feedback, or patronage."
    },
    {
        "n": "Imagine if your next boss didn't have to read your résumé because he already reads your blog."
    },
    {
        "n": "Good work isn't created in a vacuum, and that creativity is always, in some sense, a collaboration."
    },
    {
        "n": "Being a valuable part of a scenius is not necessarily about how smart or talented you are, but about what you have to contribute - the ideas you share, the quality of the connections you make, and the conversations you start."
    },
    {
        "n": "We can stop asking what others can do for us, and start asking what we can do for others."
    },
    {
        "n": "amateur - the enthusiast who pursues her work in the spirit of love (in French, the word means \"lover\")"
    },
    {
        "n": "Amateurs are not afraid to make mistakes or look ridiculous in public."
    },
    {
        "n": "Amateurs know that contributing something is better than contributing nothing."
    },
    {
        "n": "Amateurs are just regular people who get obsessed with something and spend a ton of time thinking out loud about it."
    },
    {
        "n": "The fellow-pupil can help more than the master because he knows less. The difficulty we want him to explain is one he has recently met. The expert met it so long ago he has forgotten."
    },
    {
        "n": "The best way to flourish is to retain an amateur's spirit and embrace uncertainty and the unknown."
    },
    {
        "n": "Share what you love, and the people who love the same things will find you."
    },
    {
        "n": "It sounds a little extreme, but in this day and age, if your work isn’t online, it doesn’t exist."
    },
    {
        "n": "Everyone started out as amateurs."
    },
    {
        "n": "By sharing your day-to-day process - the thing you really care about - you can form a unique bond with your audience."
    },
    {
        "n": "By putting things out there, consistently, you can form a relationship with your customers."
    },
    {
        "n": "You have to turn the invisible into something other people can see."
    },
    {
        "n": "Become a documentarian of what you do."
    },
    {
        "n": "Once a day, after you've done your day's work, go back to your documentation and find one little piece of your process that you can share."
    },
    {
        "n": "You can find the time if you look for it - in the cracks between the big stuff - your commute, your lunch break, the few hours after your kids go to bed."
    },
    {
        "n": "Don't let sharing your work take precedence over actually doing your work."
    },
    {
        "n": "Don't share absolutely everything."
    },
    {
        "n": "If you're unsure about whether to share something, let it sit for 24 hours, and then look at it with fresh eyes."
    },
    {
        "n": "Small things, over time, can get big."
    },
    {
        "n": "Be concerned with doing good work . . . and if you can build a good name, eventually that name will be its own currency."
    },
    {
        "n": "Build a cabinet of curiosities - a kind of external display of your thirst for knowledge of the world."
    },
    {
        "n": "The reading feeds the writing, which feeds the reading."
    },
    {
        "n": "Taking inspiration from the stuff that people have tossed aside for whatever reasons."
    },
    {
        "n": "All it takes to uncover hidden gems is a clear eye, an open mind, and a willingness to search for inspiration in places other people aren’t willing or able to go."
    },
    {
        "n": "Don’t try to be hip or cool. Being open and honest about what you like is the best way to connect with people who like those things, too."
    },
    {
        "n": "The truth is, our work doesn't speak for itself."
    },
    {
        "n": "Everybody loves a good story, but good storytelling doesn't come easy to everybody."
    },
    {
        "n": "Stop treating questions as interrogations, and start treating them as opportunities to connect\nwith somebody by honestly and humbly explaining what it is that you do."
    },
    {
        "n": "When someone asks you about your work - keep it short and sweet and just state the facts."
    },
    {
        "n": "Teaching doesn't mean instant competition."
    },
    {
        "n": "The minute you learn something, turn around and teach it to others."
    },
    {
        "n": "Make people better at something they want to be better at."
    },
    {
        "n": "Teaching people doesn't subtract value from what you do, it actually adds to it."
    },
    {
        "n": "If you want to be a writer, you have to be a reader first."
    },
    {
        "n": "Artists acknowledge that good work isn't created in a vacuum and that the experience of art is always a two-way street, incomplete without feedback."
    },
    {
        "n": "If you want fans, you have to be a fan first."
    },
    {
        "n": "You want to get, you have to give."
    },
    {
        "n": "Be someone worth following."
    },
    {
        "n": "The continual projection of interest."
    },
    {
        "n": "Make stuff you love and talk about stuff you love and you'll attract people who love that kind of stuff. It's that simple."
    },
    {
        "n": "Learning how to take a punch."
    },
    {
        "n": "When you put your work out into the world, you have to be ready for the good, the bad, and the ugly."
    },
    {
        "n": "Fear is often just the imagination taking a wrong turn."
    },
    {
        "n": "You can't control what sort of criticism you receive, but you can control how you react to it."
    },
    {
        "n": "Compulsive avoidance of embarrassment is a form of suicide."
    },
    {
        "n": "Work is something you do, not who you are."
    },
    {
        "n": "Keep close to your family, friends, and the people who love you for you, not just the work."
    },
    {
        "n": "Don't write off your friends because they've had a little bit of success. Don't be jealous when the people you like do well - celebrate their victory as if it's your own."
    },
    {
        "n": "Turn your audience into patrons."
    },
    {
        "n": "Whether you ask for donations, crowdfund, or sell your products or services, asking for money in return for your work is a leap you want to take only when you feel confident that you’re putting work out into the world that you think is truly worth something."
    },
    {
        "n": "The real risk is in - not changing."
    },
    {
        "n": "Be ambitious. Keep yourself busy. Think bigger. Expand your audience."
    },
    {
        "n": "The biggest problem of success is that the world conspires to stop you from doing the thing that you do because you are successful."
    },
    {
        "n": "Don't quit your show."
    },
    {
        "n": "Never lose momentum."
    },
    {
        "n": "Once a while, turn off your brain and take a break."
    },
    {
        "n": "Anyone who isn't embarrassed about who they were last year probably isn't learning enough."
    },
    {
        "n": "Don't think of anything as starting over, rather think of it as beginning again."
    },
    {
        "n": "Document your progress and share as you go so that others can learn along with you."
    },
    {
        "n": "Show your work, and when the right people show up, pay close attention to them, because they’ll have a lot to show you."
    }
]